Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: The following function all give you details about the size and orientation of the display, details about the GUI layer, and information on the mouse:
zh_cn: 接下来的函数会给你屏幕大小和方向的详细信息，也包括GUI层和鼠标上的内容或信息。

source: The following functions are available for local notifications:
zh_cn: 以下函数可用于本地通知:

source: The following functions exist that deal with views:
zh_cn: 存在下面的函数或变量处理视野的问题：

source: The following functions exist to deal with surfaces:
zh_cn: 存在以下函数处理表面层的问题：

source: The following image illustrates how all the windows functions relate and interact with each other: The following functions exist to change and get game window properties:
zh_cn: 下面的图片说明了所有窗口类函数彼此之间的关系： 以下函数用于更改或获取窗口属性：

source: The following image illustrates how this value corresponds to the HSV scale of colour:
zh_cn: 下面的图像说明了色彩的HSV数值是如何变化的：

source: The following image illustrates how this works:
zh_cn: 下面的图片说明了工作原理。

source: The following image illustrates this behaviour: It should be noted here that instances of the same depth that overlap each other in the room editor (or in game) have no guaranteed priority over which one will be "on top" of the other and.
zh_cn: 如下图: 要注意相同的深度 不 能保证谁先绘制。

source: The following image illustrates this:
zh_cn: 下面的图像说明这一点:

source: The following image is an example of how a page with three canvas elements would be set up: The page layout can be tricky, especially if you wish all the elements to line up correctly, but once the hard task of creating the layout has been completed, you can then add this html file as the default page file for the game using the HTML5 Tab of the Global Game Settings.
zh_cn: 下面的图片是一个例子展示了怎么设置一个三个画布元素的页面： 页面布局可能会比较棘手， 特别是你希望所有的元素都可以正确的排列， 一旦创建布局这个艰巨的任务已经完成，你可以为游戏加入 这个html 文件作为默认的页面，这个操作在全局游戏设定的 HTML5 选项卡上（Global Game Settings ）。.

source: The following sections all detail the many different functions that are available to you when using GML.
zh_cn: 下面的章节中详细介绍许多不同的函数，这些函数在你使用GML时都可能会用到。

source: The following sections and sub-sections explain every detail of how to get the most out of GameMaker: Studio using these advanced tools, features and options.
zh_cn: 接下来的章节里将会解释每个细节，包括 GameMaker: Studio 的高级工具使用、特性和选项。

source: The following sections exist to help get you started:
zh_cn: 以下章节帮助您入门：

source: The following two sections deal with these two aspects of displaying your game:
zh_cn: 以下各节处理显示游戏的两个方面：

source: The function returns a unique id value which would then be used in the Asynchronous Cloud Event to retrieve the relevant information from the ds_map that is created.
zh_cn: 这个函数将返回一个唯一 id ，这个值被用于 异步云事件（Asynchronous Cloud Event） 中从已创建的 ds_map 来检索关联信息。

source: The function will only work while the game is in focus and using alt + tab will unlock the mouse.
zh_cn: 这个函数只有焦点在游戏中时有用，所以使用 alt + tab时 将会解锁鼠标。

source: The function will return a unique id value that should then be used in the appropriate asynchronous event to identify the ds_map that is returned as a "call back" from the cloud service.
zh_cn: 该函数将返回惟一的id 值，那么应该使用适当的异步事件识别 ds_map 返回作为云服务的“回调（call back）”。

source: The function will return an array with 8 values per display (ie: if you have two displays, the array will have a length of 16 indices), where the values [0 ... 3] correspond to the overlapx1, overlapy1, overlapx2, overlapy2 - defining the region of overlap on this display and will be set to 0,0,0,0 if no overlap - and the values [4 ... 7] corresponds to the monitorx1, monitory1, monitorx2, monitory2 - the coordinates of the display in the virtual display space.
zh_cn: 对于每个显示器，这个函数将返回8个值添加到一个数组中（比如你有两个显示器，数组长度将是16），值[0~3] 对应 overlapx1、 overlapy1、 overlapx2、 overlapy - 定义显示器里的重叠区域，如果无重叠，将设置为 0,0,0,0 - 值 [4~ 7] 对应 monitorx1、 monitory1、 monitorx2、 monitory2 - 它们是虚拟显示器空间上的坐标。

source: The function will return an array with four keys, where key 0 and 1 are the x and y position of the top lefthand corner of the surface, and keys 2 and 3 are the x and y of the bottom righthand corner of the surface, all relative to the size of the display or window.
zh_cn: 这个函数将返回包含四个键值的数组，键0和键1是表面左上角x/y的位置，键2和键3是表面右下x/y的位置，所有的这些值响应显示器及窗口发生变化。

source: The function will return the index of the surface which should be stored in a variable for future function calls.
zh_cn: 这个函数将返回表面的索引名称，并储存在一个变量上，方便将来函数调用。

source: The fundamental thing that makes a game a game is the interaction with the player.
zh_cn: 制作一个 游戏最根本的事件是与玩家交互。

source: The games you upload can be works in progress or finished games, but they cannot be for sale as the nature of the Workshop is to offer user created content for free.
zh_cn: 你可以上传正在制作或已经完成的游戏，但是他们并不能在创意工坊中售卖，只能免费提供给玩家。

source: The general definition of a function is something like this: A function has an input and an output, and the output is related somehow to the input. In GameMaker: Studio you use functions as part of the program to make things happen in your game and there are a great number of GML (GameMaker Language) functions available to you, all of which are explained in the Reference section of the manual.
zh_cn: 函数的基本定义是这样的：函数有输入（自变量）和输出（因变量），输出用某种方式对应着输入。 在 GameMaker: Studio中，你可以使用函数作为 程序 的一部分，作用于游戏的某些东西。并且 GML (GameMaker Language) 中有大量可用的函数，参考手册部分将作详细解释。

source: The height of the GUI (-1 equals 1:1 with the display or application_surface).
zh_cn: GUI的高度 (-1 表面 与显示器或应用表面1:1的比例).

source: The height of the area in the source surface to copy from.
zh_cn: 源表面层内，复制区域的高度。

source: The height of the area of the screen to capture
zh_cn: 捕捉屏幕区域的高度。

source: The height of the new surface.
zh_cn: 新的表面层的高度。

source: The height of the part to save.
zh_cn: 保存部分的高度。

source: The height of the surface to be created.
zh_cn: 创建的表面层的高度。

source: The height of the viewport (or combined view ports if more than one are active) define the height of the game window or background canvas at the start of the game, but changing this value after the game has started will have no visible effect on the game window size.
zh_cn: 视口高度（有一个以上的可见视野时组合视口区域） 在游戏开始时定义游戏窗口或者背景画布的高度，而游戏开始后改变这个值对窗口大小没有明显的影响。

source: The help Key Binding Editor permits you to re-assign the default GameMaker: Studio IDE keyboard shortcuts to those that you choose.
zh_cn: 热键设定编辑器 允许你重新设计 GameMaker: Studio 集成开发环境的键盘快捷键。

source: The id of the view to compare the mouse position to.
zh_cn: 比较鼠标位置的视野的id。

source: The image below illustrates how this works:
zh_cn: 下图描绘了这是如何工作的：

source: The image below shows an example of how these options affect the path:
zh_cn: 如下的图片展示了一些不同设置的路径的样例：

source: The image below shows how the game room for the above canvas example would be set out: Finally you would then use this function to create the surfaces, with the name being the same as that used for the canvas elements and the size corresponding to the size of that same canvas.
zh_cn: 下面的图片展示的是如何为上面的画布例子设置游戏房间的参数：最后，你可以再使用这个函数来创建表面图，名称和画布元素使用的相同，大小符合同一个画布的尺寸。

source: The index of the destination grid.
zh_cn: 靶栅格的索引

source: The index of the grid.
zh_cn: 栅格的索引

source: The index of the source grid.
zh_cn: 源栅格的索引

source: The index.html can also be customised to show your game with a different background colour, or at a different position etc... but a knowledge of the HTML language is necessary for this (see the HTML5 Tab of the Global Game Settings).
zh_cn: index.html 网页还可以自定义背景颜色或位置等...但是 HTML 语言必要的知识请查阅 Global game settings (游戏全局设置) 里的 HTML5 Tab (HTML5 选项卡)

source: The instance found beneath the mouse cursor will then have its information displayed in the Selected Instance window, where you can see it's built in and instance variables, the same as for the Instances window.
zh_cn: 在鼠标指针下的实例的信息会显示在Selected Instance窗口中。在此处你能看到它的内置信息和实例变量，与实例窗口是一样的。

source: The last button permits you to select a room to be drawn as a background which can be very useful for giving you a "feel" for how the path will work in any given game room.
zh_cn: 最后一个按钮可以让你选择一个房间的背景显示在可视化区域中，这个可以让你更好的把握路径在房间中的效果。

source: The left edge of the rectangle to check
zh_cn: 矩形的左边界。

source: The left part is a fairly standard file selector in which you can navigate around your computer and select the sprite that you want to import.
zh_cn: 剩下的只是在你的电脑里找到合适的图片导入即可。

source: The left position of the region of cells to copy from the source grid.
zh_cn: 从源栅格复制的单元格区域的左端位置

source: The level of anti-aliasing filtering (0, 2, 4 or 8).
zh_cn: 抗锯齿滤镜的等级 (0, 2, 4 or 8)。

source: The maximum height in pixels for the game window.
zh_cn: 游戏窗口的最大像素高度。

source: The maximum width in pixels for the game window.
zh_cn: 游戏窗口的最大像素宽度。

source: The minimum height in pixels for the game window.
zh_cn: 游戏窗口的最小像素高度。

source: The minimum width in pixels for the game window.
zh_cn: 游戏窗口的最小像素宽度。

source: The most up to date graphics drivers for OpenGL ES acceleration
zh_cn: 用于 OpenGL ES 加速的最新显卡驱动

source: The name of the canvas element to link the surface to.
zh_cn: 所链接的画布元素名称。

source: The name of the saved image file.
zh_cn: 保存的图像文件的名称。

source: The new height of the window.
zh_cn: 窗口的新高度。

source: The new resource is given a default name and a form is opened in which you can change the properties of that resource.
zh_cn: 新资源会有个默认名称，并且打开属性窗口。

source: The new value for all grid cells.
zh_cn: 待叠加到栅格内所有单元格的值

source: The new width of the window.
zh_cn: 窗口的新宽度。

source: The new x coordinate of the window.
zh_cn: 窗口的新的x坐标。

source: The new y coordinate of the window.
zh_cn: 窗口的新的y坐标。

source: The next thing you should do is set up your room and views, as each surface will need to be associated with a specific view to "capture" the game images (see the view variable view_surface_id[0...7]).
zh_cn: 下面你是设置房间和视野，因为每个表面层都需要关联一个特定的视野以捕捉游戏画面（查阅视野变量 view_surface_id[0...7]）。

source: The notification message text (a string)
zh_cn: 通知的正文(字符串格式)

source: The notification title (a string)
zh_cn: 通知的标题 (字符串格式)

source: The only exception to this rule is the Profile view, which updates in real time when enabled independently of the real-time switch, as it has its own on/off button.
zh_cn: 此项规则唯一的例外是Profile（概况）视窗，它的启用与否是独立于实时更新开关以外的，它有自己的on/off开关。

source: The other two tags are used for giving the description and can be custom tags that you input (click the box and write the tag) or they can also be selected from a long list of pre-made descriptive tags accessed through another drop-down menu.
zh_cn: 其他两个用于描述的标签可随意填写 (其中也有一些预定义标签可供选择))。

source: The path editor has a center point (0,0) and its coordinate system works the same as for the room editor, in that down is +y, up is -y, right is +x and left is -x, and in this way you can plot your path around these coordinates.
zh_cn: 路径编辑器有一个中心点（0，0），并且它的坐标系统是和房间编辑器相同的，也就是说向下y坐标递增，向上y坐标递减，向右x坐标递增，向左x坐标递减。这样你就可以根据这些坐标来绘制你的路径。

source: The possibilities are endless!
zh_cn: 它有无限种可能性！

source: The possibility of buying extra target modules (currently Mac OSX, HTML5, iOS, Ubuntu, Windows Phone, Android and Tizen)
zh_cn: 可以额外购买模块(目前有 Mac OSX, HTML5, iOS, Ubuntu, Windows Phone, Android and Tizen)

source: The previous GameMaker versions used Delphi, so this means that any game imported from previous versions may not work without certain changes.
zh_cn: 老版本的 GameMaker 使用的是 Delphi，这意味着从老版本导入的游戏 可能不会工作，除非你作出正确的修改。

source: The radius of the disk on the grid.
zh_cn: 栅格中圆盘的半径

source: The render target index to use (from 0 to 3).
zh_cn: 渲染目标的索引 (从 0 到 3)。

source: The requisites for the YYC target module will depend on the original target modules that you have and wish to use it with, as they will need to be set up correctly before the YYC will work correctly.
zh_cn: 对于 YYC 目标模块的要求，取决于你拥有和希望使用的原始目标模块，因为它们在 YYC 正常工作之前就需要被正确的设置。

source: The return value will change during the draw event when you have various views as the draw event is called once for each view in succession.
zh_cn: 当存在多个视野时，每个视野将在绘制事件中依次调用一次，这个变量的返回值也会在绘制时同时改变。

source: The right edge of the rectangle to check
zh_cn: 矩形的右边界。

source: The right position of the region of cells to copy from the source grid.
zh_cn: 从源栅格复制的单元格区域的右端位置

source: The same can be done for enemy objects too!
zh_cn: 同样可以制作敌军物体！

source: The same goes if you supply more arguments than you require.
zh_cn: 同时，提供的参数数量超过需要的也会报错。

source: The screenshot may appear stretched or distorted in this window, but once uploaded it will appear as it should to those that visit the Workshop page for your game.
zh_cn: 截图可能出现拉伸或扭曲，但在创意工坊页面看起来会是正常的，所以不必担心。

source: The script itself is something simple like:
zh_cn: 脚本内容：

source: The search tags are limited to a maximum of three, where the first one must be the "Genre" of the game which you select from a drop-down menu.
zh_cn: 最后，在底部可以添加搜索标签 (最多三个，其中第一个必须是从下拉菜单选择的 "Genre(流派)"，

source: The second angle to use.
zh_cn: 待使用的第二个角。

source: The second button in this window is marked From File and it works similarly to that explained above.
zh_cn: 其次是标记为 From File 的这个按钮。它的功能和上面这个很接近。

source: The selection coordinates are based on the absolute size of the display, so (0,0) is always the top left hand corner of the screen.
zh_cn: 选择区域的坐标基于显示器的 绝对尺寸，所以 (0,0)一直是屏幕的左上角。

source: The sound window also has other options which are explained below.
zh_cn: 声音窗口还有如下选项。

source: The source window is where you can see the source code for your game, and you can have multiple tabs open in this window, with each tab showing the code from a different instance or event.
zh_cn: source窗口是你可以查看你的游戏中的源代码的地方，而你可以在其中拥有多个可选子窗口，每个子窗口都显示着来自不同实例或事件的代码。

source: The speed difference is negligible for smaller arrays, but larger ones should be optimised as much as possible in this way.
zh_cn: 对于小的数组，两种速度的差异微乎其微，但是大数组应该用这种方式优化。

source: The speed value is actually a percentage of the speed at which you make the instance move along the path, so if you start an instance at a speed of 2 (2 pixels per step) along a path and then one of the path points has a Sp value of 50, the instance will reduce speed as it approaches this point to a speed of 1 (50% of the path speed).
zh_cn: 这个速度值实际上是个百分比，当实例经过这个点时速度会按照这个百分比改变。如果你的实例沿路径运动时的初始速度是2（2像素每步），然后其中一个路径点的 Sp 值为50，那么在实例运动经过这个路径点时，它的速度会减小为1（当前速度的50%）。

source: The standard way of doing this in GameMaker is to put actions in mouse or keyboard events, but sometimes you need more control, especially when creating something for mobile devices or HTML5.
zh_cn: 在 GameMaker 中通常的做法是在鼠标或按键事件中放置动作，但有时你需要更多的控制，尤其是移动设备或 HTML5。

source: The starting x position within the surface.
zh_cn: 表面层内的起始x位置

source: The starting y position within the surface.
zh_cn: 表面层内的起始y位置。

source: The statement (which can also be a code block) is executed until the expression is found true, and the initial statement is always executed at least once.
zh_cn: 语句（也可以是代码块）会一直运行直到表达式为真，至少会运行一次。

source: The statement is repeated the number of times indicated by the rounded value of the expression.
zh_cn: 语句（statement）被重复执行的次数由表达式（expression）的近似值指定。

source: The surface must be saved as a *.png format file, and the (x,y) position must be given as local coordinates to the surface, bearing in mind that the top left corner of the surface is always (0,0).
zh_cn: 表面层 只能 保存为 *.png 格式的文件，给定的 (x,y)坐标必须是表面层的局部坐标，铭记的表面的左上角总是（0,0）。

source: The surface must be saved as a *.png format file.
zh_cn: 表面层 只能 保存为 *.png 格式文件。

source: The surface_id is that of a surface you have created previously, or the application_suface, and the function will resize that surface.
zh_cn: 这个 surface_id 是之前创建好的表面层，或者是application_suface，这个函数将重置表面层的大小。

source: The toolbar in GameMaker: Studio contains buttons to create each of the resources you see present as well as a selection of additional buttons to create a new project, open an existing project, save a project, create an executable (export a final project), open the Global Game Settings and Extension Packages as well as opening the Help file.
zh_cn: GameMaker: Studio 中的工具栏包含各种按钮可以创建目前你看到的资源，以及其他的按钮:创建新工程、打开工程、保存工程、创建可执行程序 (导出最终工程)、打开全局游戏设定和扩展包以及打开帮助文件。

source: The top edge of the rectangle to check.
zh_cn: 矩边的顶部边界。

source: The top position of the region of cells to copy from the source grid.
zh_cn: 从源栅格复制的单元格区域的顶端位置

source: The transparency of the colour with which the screen will be cleared
zh_cn: 用来填充屏幕的颜色的透明度

source: The type of window that you choose to open will depend on what it is that you wish to watch, with the following options available:
zh_cn: 你选择的窗口的类型取决于你想要监视什么，有下列可选项：

source: The use of this surface means that you can easily create incredible transitions using shaders, or take the screen and wrap it around a 3D form, or simply scale a low-res game up to any resolution screen...
zh_cn: 使用这个表面层意味着你可以轻松地过渡到使用着色器，采集屏幕用并3D模式环绕，或者简单的缩放低分辨率的游戏到任意分辨率的屏幕上。

source: The value to add to the cell.
zh_cn: 待叠加到单元格的值

source: The value to add to the cells within the disk.
zh_cn: 待叠加给圆盘内单元格的值

source: The value to add to the region cells.
zh_cn: 待叠加到区域单元格的值。

source: The value to be added must be of the same type as that held within the grid cells, ie: you cannot add a string to a real or vice-versa, and for strings this corresponds to concatenation.
zh_cn: 这个待叠加的值必须和这些栅格的单元格中所承载的值是同一类型，比如：你不能把一个字符串叠加给一个实数，反之亦然，并且对于字符串来说这相当于串接

source: The value to be added must be the same type as that held within the grid cell, ie: you cannot add a string to a real or vice-versa, and for strings this corresponds to concatenation.
zh_cn: 这个待叠加的值必须和栅格内单元格所承载的值是同一类型，比如你不能把一个字符串叠加给一个实数，反之亦然，并且对于字符串来说，这相当于串接。.

source: The view port is the area on the screen where the view is drawn.
zh_cn: 视口是视野在屏幕上的绘制区域。.

source: The view will now not be drawn to the screen, meaning that you will need to do either:
zh_cn: 这个视野现在不会 绘制到屏幕上，意味着你或者需要去做以下操作：

source: The whole idea of the Debug Module is to permit you to "watch" every detail of your game.
zh_cn: 调试模块的主要思想就是允许你监视你的游戏中的每个细节。

source: The width of the GUI (-1 equals 1:1 with the display or application_surface).
zh_cn: GUI的宽度(-1 表示 与显示器或应用表面1:1的比例 ).

source: The width of the area in the source surface to copy from.
zh_cn: 源表面层内，复制区域的宽度。

source: The width of the area of the screen to capture
zh_cn: 捕捉屏幕区域的宽度。

source: The width of the new surface.
zh_cn: 新表面层的宽度。

source: The width of the part to save.
zh_cn: 保存部分的宽度。

source: The width of the surface to be created.
zh_cn: 创建的表面层的宽度。

source: The width of the viewport (or combined view ports if more than one are active) define the width of the game window or background canvas at the start of the game, but changing this value after the game has started will have no visible effect on the game window size.
zh_cn: 视口宽度（有一个以上的可见视野时组合视口区域） 在游戏开始时定义游戏窗口或者背景画布的宽度，而游戏开始后改变这个值对窗口大小没有明显的影响。

source: The x coordinate in the display.
zh_cn: 显示器上的x坐标。

source: The x coordinate in the window.
zh_cn: 窗口内的x坐标

source: The x coordinate of the first component of the vector
zh_cn: 向量组件的第一个x坐标

source: The x coordinate of the pixel to check
zh_cn: 表面上的x坐标，用于获取对应的像素。

source: The x coordinate of the second component of the vector
zh_cn: 向量组件的第二个x坐标

source: The x coordinate of the top left corner of the area of the screen to capture
zh_cn: 捕捉屏幕区域的左上角X坐标。

source: The x coordinate of where to position the window.
zh_cn: 窗口位置的x坐标。

source: The x position in the source surface to copy from.
zh_cn: 源表面层内，复制区域的x坐标。

source: The x position of the cell in the grid.
zh_cn: 栅格内单元格的x位置

source: The x position of the disk on the grid.
zh_cn: 栅格内圆盘区域x位置。

source: The x position of the left of the region in the grid.
zh_cn: 栅格内区域左端x位置。

source: The x position of the right of the region in the grid.
zh_cn: 栅格内区域右端x位置。

source: The x position on the destination grid to add the source region to.
zh_cn: 待叠加给的靶栅格上的x位置

source: The x position on the surface from which to get the pixel.
zh_cn: 表面上的x坐标，用于获取对应的像素。

source: The x position to copy to.
zh_cn: 目的表面层指定的x坐标，从源表面层复制到这个位置。

source: The x-position of the viewport within the drawing region.
zh_cn: 绘制区域内视口的x坐标。

source: The y coordinate in the display.
zh_cn: 显示器上的y坐标。

source: The y coordinate in the window.
zh_cn: 窗口内的y坐标

source: The y coordinate of the first component of the vector
zh_cn: 向量组件的第一个y坐标

source: The y coordinate of the pixel to check
zh_cn: 表面上的y坐标，用于获取对应的像素。

source: The y coordinate of the second component of the vector
zh_cn: 向量组件的第二个y坐标

source: The y coordinate of the top left corner of the area of the screen to capture
zh_cn: 捕捉屏幕区域的右上角Y坐标。

source: The y coordinate of where to position the window.
zh_cn: 窗口位置的x坐标。.

source: The y position in the source surface to copy from.
zh_cn: 源表面层内，复制区域的y坐标。

source: The y position of the bottom of the region in the grid.
zh_cn: 栅格内区域底端的y位置。

source: The y position of the cell in the grid.
zh_cn: 栅格内单元格的y位置

source: The y position of the disk on the grid.
zh_cn: 栅格内圆盘区域的y位置。

source: The y position of the top of the region in the grid.
zh_cn: 栅格内区域顶端的y位置。

source: The y position on the destination grid to add the source region to.
zh_cn: 待叠加给的靶栅格上的y位置<

source: The y position on the surface from which to get the pixel.
zh_cn: 表面上的y坐标，用于获取对应的像素。

source: The y position to copy to.
zh_cn: 目的表面层指定的y坐标，从源表面层复制到这个位置。

source: The y-position of the viewport within the drawing region.
zh_cn: 绘制区域内的视口的y坐标。

source: Then statement 2 and then the expression is evaluated again.
zh_cn: 然后语句2，并再次判断表达式。

source: There are a couple of things that should be noted when loading the different bitmap files:
zh_cn: 加载不同格式图片应该注意的事情:

source: There are a few differences to note between supported platforms:
zh_cn: 不同平台会有差异，详情如下：

source: There are a few functions associated with the use of arrays too.
zh_cn: 下面有一些数组相关的函数。

source: There are a large number of different events that can take place and a large number of different actions that you can let your objects take too.
zh_cn: 有大量不同的事件和动作。

source: There are a number of different places where you can use this language to create and control your game:
zh_cn: 它们有许多不同，使用这个语言你可以更好的创建和控制你的游戏，具体如下：

source: There are a number of different types of statements and functions, which are discussed at length in subsequent sections of the manual.
zh_cn: 语句和函数分为多种，分别在帮助文件的不同章节加以说明。

source: There are a number of different versions of GameMaker: Studio available for you to use, and each one is designed to scale to the level of programming experience of the end-user, either with the GameMaker product or in general.
zh_cn: 有许多不同的 GameMaker: Studio 版本供你选择，每一个版本的规模取决于最终用户的编程经验，无论是 GameMaker 产品或一般产品。

source: There are actions to go from room to room so that you can create button objects that, when pressed, will move the player from one room of the game to another.
zh_cn: 有从一个房间移动到另一个房间的动作，所以你可以创建一个按钮物体做到这件事。

source: There are also a couple of special functions that can be used to save the display, or part of it, to an image file:
zh_cn: 也有多个特别的函数用来全屏或部分截图，保存为图片文件：

source: There are also expression "short-cuts" called accessors for use with certain Data Structures, which enable you to add, or replace data within these formats quickly and easily and without the use of any function calls.
zh_cn: 这些是表达式的“捷径”，叫做 访问器 ，用于某些特定的数据结构，通过这些格式快捷地添加、替换数据，无需调用数据结构的函数。

source: There are many cases when you may want to do this, for example in a collision with a bullet object, you may want to find out how much damage the bullet does by accessing a variable in the bullet, or you might want to stop the motion of all the balls in a puzzle , or you might want to move the main character to a particular position, or any number of other situations you typically come across in any game.
zh_cn: 在很多情况下你需要做到这一点，比如子弹的一次碰撞中，你可能想要通过访问了弹的变量知道子弹造成了多少伤害，或者你想要在谜题中让所有的球停下来，或者你想要将主角移动到特定地点，或任何你可能会在其它游戏中遇到的任何情况。

source: There are no functions in GameMaker: Studio to deal with remote notifications, as they must all be generated by your server and handled by the respective App Stores.
zh_cn: GameMaker: Studio 并不提供函数来处理远程通知, 因为他们都必须由服务器生成并需要通过各自的应用程序商店处理。

source: There are still more events for each object and these are covered further along in the manual.
zh_cn: 还有更多的事件会在后面讲到。.
